![](https://i.imgur.com/0AUxkXt.png)

# Lab 1 - Basic Python & SQL Exercise

### ADVANCED PYTHON

### 3.
This problem was asked by Snapchat.

Given a list of possibly overlapping intervals, return a new list of intervals where all overlapping intervals have been merged.

The input list is not necessarily ordered in any way.

For example, given [(1, 3), (5, 8), (4, 10), (20, 25)], you should return [(1, 3), (4, 10), (20, 25)].

In [ ]:
# Your code here
# @_@

### 5.
You are given a string. The only operation allowed is to insert characters in the beginning of the string. How many minimum characters are needed to be inserted to make the string a palindrome string

Example:
Input: ABC
Output: 2
Input: AACECAAAA
Output: 2

In [76]:
# Your code here
def is_palindrome(s):
    return s[::-1] == s

def get_nearest_palindrome(s):
    if is_palindrome(s):
        return s

    if s[0] == s[-1]:
        return s[0] + get_nearest_palindrome(s[1:-1]) + s[-1]
    else:
        pal_1 = s[0] + get_nearest_palindrome(s[1:]) + s[0]
        pal_2 = s[-1] + get_nearest_palindrome(s[:-1]) + s[-1]

        if len(pal_1) > len(pal_2):
            return pal_2
        elif len(pal_1) < len(pal_2):
            return pal_1
        return pal_1 if pal_1 < pal_2 else pal_2
def min_char_insert_palindrome(s):
    new = get_nearest_palindrome(s)
    print(new)
    return len(new) - len(s)
min_char_insert_palindrome('google')

elgoogle

2

## Basic SQL

SQL, or Structured Query Language, is a language designed to allow both technical and non-technical users query, manipulate, and transform data from a **relational database**. And due to its simplicity, SQL databases provide safe and scalable storage for millions of websites and mobile applications.

A relational database represents a collection of related (two-dimensional) tables. Each of the tables are similar to an Excel spreadsheet, with a fixed number of named columns (the attributes or properties of the table) and any number of rows of data.

For example, if the Department of Motor Vehicles had a database, you might find a table containing all the known vehicles that people in the state are driving. This table might need to store the model name, type, number of wheels, and number of doors of each vehicle for example.

| Id | Make/Model | # Wheels | # Door | Type |
|:---:|:----------------------------:|:---------------:|:-----------:|:--------:|
| 1 | Ford Focus | 4 | 4 | Sedan |
| 2 | Tesla Roadster | 4 | 2 | Sports |
| 3 | Kawakasi Ninja | 2 | 0 | Motorcycle |
| 4 | McLaren Formula 1 | 4 | 0 | Race |
| 5 | Testla S | 4 | 4 | Sedan |

In such a database, you might find additional related tables containing information such as a list of all registered drivers in the state, the types of driving licenses that can be granted, or even driving violations for each driver.

By learning SQL, the goal is to learn how to answer specific questions about this data, like *"What types of vehicles are on the road have less than four wheels?"*, or *"How many models of cars does Tesla produce?"*, to help us make better decisions down the road.

### Connect to the database

![](https://i.imgur.com/kCaiMK5.png)

**Run those cells below**

In [12]:
# Download database
import wget
wget.download('https://ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com/devc/chinook.db')

'chinook.db'

In [13]:
import sqlite3
conn = sqlite3.connect('chinook.db')

In [14]:
import pandas as pd
data = pd.read_sql_query('SELECT * FROM albums;', conn)
data.head() 
# head(n) is a function that show n first rows of the data, by default n=5

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

**Your turn**

In [15]:
# List first 10 tracks and its album's title order by track's name
query = ''' SELECT tracks.Name, albums.Title FROM 
        tracks INNER JOIN albums ON tracks.AlbumId = albums.AlbumId
        ORDER BY tracks.Name LIMIT 10'''
pd.read_sql_query(query, conn)

,Name,Title
0,"""40""",War
1,"""?""","Lost, Season 2"
2,"""Eine Kleine Nachtmusik"" Serenade In G, K. 525...",Sir Neville Marriner: A Celebration
3,#1 Zero,Out Of Exile
4,#9 Dream,Instant Karma: The Amnesty International Campa...
5,'Round Midnight,The Essential Miles Davis [Disc 1]
6,(Anesthesia) Pulling Teeth,Kill 'Em All
7,(Da Le) Yaleo,Supernatural
8,(I Can't Help) Falling In Love With You,UB40 The Best Of - Volume Two [UK]
9,(Oh) Pretty Woman,Diver Down

In [23]:
# List all employees and who they report to
query = ''' SELECT e1.EmployeeId, e1.LastName, e1.FirstName, e1.ReportsTo, e2.EmployeeId, e2.LastName, e2.FirstName 
            FROM employees AS e1 INNER JOIN employees AS e2 ON e1.ReportsTo = e2.EmployeeId'''
pd.read_sql_query(query, conn)

   EmployeeId  LastName FirstName  ReportsTo  EmployeeId  LastName FirstName
0           2   Edwards     Nancy          1           1     Adams    Andrew
1           3   Peacock      Jane          2           2   Edwards     Nancy
2           4      Park  Margaret          2           2   Edwards     Nancy
3           5   Johnson     Steve          2           2   Edwards     Nancy
4           6  Mitchell   Michael          1           1     Adams    Andrew
5           7      King    Robert          6           6  Mitchell   Michael
6           8  Callahan     Laura          6           6  Mitchell   Michael

In [54]:
# List the first five customers order by their supporter's first name in descending order
query = ''' SELECT customers.FirstName, customers.LastName, customers.SupportRepId, employees.EmployeeId, employees.FirstName
            FROM customers INNER JOIN employees ON customers.SupportRepId = employees.EmployeeId 
            ORDER BY employees.FirstName DESC LIMIT 5'''
pd.read_sql_query(query, conn)

   FirstName LastName  SupportRepId  EmployeeId FirstName
0     Leonie   Köhler             5           5     Steve
1     Helena     Holý             5           5     Steve
2     Astrid   Gruber             5           5     Steve
3  Alexandre    Rocha             5           5     Steve
4       Mark  Philips             5           5     Steve

### OUTER JOINS

Depending on how you want to analyze the data, the INNER JOIN we used last lesson might not be sufficient because the resulting table only contains data that belongs in both of the tables.

If the two tables have asymmetric data, which can easily happen when data is entered in different stages, then we would have to use a LEFT JOIN, RIGHT JOIN or FULL JOIN instead to ensure that the data you need is not left out of the results.

```
SELECT column, another_column, …
FROM mytable
INNER/LEFT/RIGHT/FULL JOIN another_table 
    ON mytable.id = another_table.matching_id
WHERE condition(s)
ORDER BY column, … ASC/DESC
LIMIT num_limit OFFSET num_offset;
```

Sometimes, it's not possible to avoid **NULL** values. In these case, you can test a column for **NULL** values in a WHERE clause by using either the **IS NULL** or **IS NOT NULL** constraint.

```
SELECT column, another_column, …
FROM mytable
WHERE column IS/IS NOT NULL
AND/OR another_condition
AND/OR …;
```

In [29]:
# Find all tracks that couldn't be sold (null invoice_items)
query1 = """ 
        SELECT tracks.TrackId, tracks.Name, invoice_items.TrackId AS invoice_items_TrackId
        FROM tracks LEFT JOIN invoice_items
        ON tracks.TrackId = invoice_items.TrackId
        WHERE invoice_items.TrackId IS NULL
        """
pd.read_sql_query(query1, conn)

,TrackId,Name,invoice_items_TrackId
0,7,Let's Get It Up,None
1,11,C.O.D.,None
2,17,Let There Be Rock,None
3,18,Bad Boy Boogie,None
4,22,Whole Lotta Rosie,None
...,...,...,...
1514,3497,"Erlkonig, D.328",None
1515,3498,"Concerto for Violin, Strings and Continuo in G...",None
1516,3501,"L'orfeo, Act 3, Sinfonia (Orchestra)",None
1517,3502,"Quintet for Horn, Violin, 2 Violas, and Cello ...",None
1518,3503,Koyaanisqatsi,None

In [33]:
# List all genres and the distinct media types in each genre
query = """ 
        SELECT DISTINCT genres.Name AS Genres_Name, media_types.Name As MediaTypes_Name
        FROM tracks
        LEFT JOIN media_types ON tracks.MediaTypeId = media_types.MediaTypeId
        LEFT JOIN genres ON tracks.GenreId = genres.GenreId
        """
pd.read_sql_query(query, conn)

           Genres_Name              MediaTypes_Name
0                 Rock              MPEG audio file
1                 Rock     Protected AAC audio file
2                 Jazz              MPEG audio file
3                Metal              MPEG audio file
4   Alternative & Punk              MPEG audio file
5        Rock And Roll              MPEG audio file
6                Blues              MPEG audio file
7                Latin              MPEG audio file
8               Reggae              MPEG audio file
9                  Pop              MPEG audio file
10          Soundtrack              MPEG audio file
11          Bossa Nova              MPEG audio file
12      Easy Listening              MPEG audio file
13         Heavy Metal              MPEG audio file
14            R&B/Soul              MPEG audio file
15   Electronica/Dance              MPEG audio file
16               World              MPEG audio file
17         Hip Hop/Rap              MPEG audio file
18     Science Fiction  Protected MPEG-4 video file
19            TV Shows  Protected MPEG-4 video file
20    Sci Fi & Fantasy  Protected MPEG-4 video file
21               Drama  Protected MPEG-4 video file
22              Comedy  Protected MPEG-4 video file
23                 Pop     Protected AAC audio file
24         Alternative     Purchased AAC audio file
25                Jazz               AAC audio file
26               World               AAC audio file
27   Electronica/Dance               AAC audio file
28                Rock               AAC audio file
29               Latin               AAC audio file
30           Classical               AAC audio file
31         Alternative     Protected AAC audio file
32         Alternative  Protected MPEG-4 video file
33           Classical     Protected AAC audio file
34           Classical     Purchased AAC audio file
35               Opera     Protected AAC audio file
36            R&B/Soul     Protected AAC audio file
37          Soundtrack     Protected AAC audio file

### Queries with aggregates

SQL also supports the use of aggregate expressions (or functions) that allow you to summarize information about a group of rows of data.

Common aggregate functions:

| Functions | Description |
|:-:|:-:|
|**COUNT**(*), **COUNT**(column) | A common function used to counts the number of rows in the group if no column name is specified. Otherwise, count the number of rows in the group with non-NULL values in the specified column.|
|**MIN**(column) | Finds the smallest numerical value in the specified column for all rows in the group.|
|**MAX**(column) | Finds the largest numerical value in the specified column for all rows in the group.|
|**AVG**(column) | Finds the average numerical value in the specified column for all rows in the group.|
|**SUM**(column) | Finds the sum of all numerical values in the specified column for the rows in the group.|

More docs: [SQLite](http://www.sqlite.org/lang_aggfunc.html), [MySQL](https://dev.mysql.com/doc/refman/5.6/en/group-by-functions.html), [Postgres](http://www.postgresql.org/docs/9.4/static/functions-aggregate.html)

In addition to aggregating across all the rows, you can instead apply the aggregate functions to individual groups of data within that group. This would then create as many results as there are unique groups defined as by the  **GROUP BY** clause.

```
SELECT AGG_FUNC(column_or_expression) AS aggregate_description, …
FROM mytable
WHERE constraint_expression
GROUP BY column;
```

Our queries are getting fairly complex, but we have nearly introduced all the important parts of a  **SELECT** query. One thing that you might have noticed is that if the **GROUP BY** clause is executed after the **WHERE** clause (which filters the rows which are to be grouped), then how exactly do we filter the grouped rows?

Luckily, SQL allows us to do this by adding an additional **HAVING** clause which is used specifically with the **GROUP BY** clause to allow us to filter grouped rows from the result set.

```
SELECT group_by_column, AGG_FUNC(column_expression) AS aggregate_result_alias, …
FROM mytable
WHERE condition
GROUP BY column
HAVING group_condition;
```

In [44]:
query = """ 
        SELECT * FROM invoice_items LIMIT 5
        """
pd.read_sql_query(query, conn)

   InvoiceLineId  InvoiceId  TrackId  UnitPrice  Quantity
0              1          1        2       0.99         1
1              2          1        4       0.99         1
2              3          2        6       0.99         1
3              4          2        8       0.99         1
4              5          2       10       0.99         1

In [43]:
query = """ 
        SELECT * FROM invoices LIMIT 5
        """
pd.read_sql_query(query, conn)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
1,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,None,Norway,0171,3.96
2,3,8,2009-01-03 00:00:00,Grétrystraat 63,Brussels,None,Belgium,1000,5.94
3,4,14,2009-01-06 00:00:00,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
4,5,23,2009-01-11 00:00:00,69 Salem Street,Boston,MA,USA,2113,13.86

In [47]:
# Find the revenue of 2013
query = """ 
        SELECT COUNT(Total) AS revenue_of_2013
        FROM invoices WHERE InvoiceDate LIKE "2013%"
        """
pd.read_sql_query(query, conn)

   revenue_of_2013
0               80

In [53]:
# Find the number of tracks belong to the genre Rock
query = """ 
        SELECT COUNT(tracks.TrackId) AS number_of_tracks_Rock
        FROM tracks INNER JOIN genres ON tracks.GenreId = genres.GenreId
        WHERE genres.Name = 'Rock'
        """
pd.read_sql_query(query, conn)

   number_of_tracks_Rock
0                   1297

In [75]:
# Find the customer who paid the most
query = ''' SELECT CustomerId, LastName, FirstName
            FROM customers 
            WHERE CustomerId = (SELECT CustomerId
            FROM invoices
            GROUP BY CustomerId
            HAVING SUM(Total)
            ORDER BY SUM(Total) DESC LIMIT 1)
            '''
pd.read_sql_query(query, conn)

   CustomerId LastName FirstName
0           6     Holý    Helena

In [71]:
# Find the number of customers each employee has supported
query = ''' SELECT SupportRepId, COUNT(CustomerId)
            FROM customers
            GROUP BY SupportRepId
            HAVING COUNT(CustomerId)
            '''
pd.read_sql_query(query, conn)

   SupportRepId  COUNT(CustomerId)
0             3                 21
1             4                 20
2             5                 18

In [ ]:
# Find the richest artist
pd.read_sql_query(query, conn)
# @_@